[Reference](https://towardsdatascience.com/reshaping-dataframes-in-pandas-f6bfbb2c5b0f)

# # Type -1: Reforming without aggregation

In [3]:
import numpy as np
import pandas as pd

In [4]:
np.random.seed(100)

df=pd.DataFrame({"Date":pd.Index(pd.date_range(start='2/2/2019',periods=3)).repeat(3), "Class":["1A","2B","3C","1A","2B","3C","1A","2B","3C"], "Numbers":np.random.randn(9)})

df['Numbers2'] = df['Numbers'] * 2

df

        Date Class   Numbers  Numbers2
0 2019-02-02    1A -1.749765 -3.499531
1 2019-02-02    2B  0.342680  0.685361
2 2019-02-02    3C  1.153036  2.306072
3 2019-02-03    1A -0.252436 -0.504872
4 2019-02-03    2B  0.981321  1.962642
5 2019-02-03    3C  0.514219  1.028438
6 2019-02-04    1A  0.221180  0.442359
7 2019-02-04    2B -1.070043 -2.140087
8 2019-02-04    3C -0.189496 -0.378992

# Pivot

In [5]:
df.pivot(index='Date', columns='Class', values='Numbers')

Class             1A        2B        3C
Date
2019-02-02 -1.749765  0.342680  1.153036
2019-02-03 -0.252436  0.981321  0.514219
2019-02-04  0.221180 -1.070043 -0.189496

In [6]:
df.pivot(index='Date', columns='Class')

             Numbers                      Numbers2
Class             1A        2B        3C        1A        2B        3C
Date
2019-02-02 -1.749765  0.342680  1.153036 -3.499531  0.685361  2.306072
2019-02-03 -0.252436  0.981321  0.514219 -0.504872  1.962642  1.028438
2019-02-04  0.221180 -1.070043 -0.189496  0.442359 -2.140087 -0.378992

In [7]:
df.pivot(index='Date', columns='Class')['Numbers']

Class             1A        2B        3C
Date
2019-02-02 -1.749765  0.342680  1.153036
2019-02-03 -0.252436  0.981321  0.514219
2019-02-04  0.221180 -1.070043 -0.189496

# Melt

In [8]:
df.melt(id_vars=['Date','Class'])

         Date Class  variable     value
0  2019-02-02    1A   Numbers -1.749765
1  2019-02-02    2B   Numbers  0.342680
2  2019-02-02    3C   Numbers  1.153036
3  2019-02-03    1A   Numbers -0.252436
4  2019-02-03    2B   Numbers  0.981321
5  2019-02-03    3C   Numbers  0.514219
6  2019-02-04    1A   Numbers  0.221180
7  2019-02-04    2B   Numbers -1.070043
8  2019-02-04    3C   Numbers -0.189496
9  2019-02-02    1A  Numbers2 -3.499531
10 2019-02-02    2B  Numbers2  0.685361
11 2019-02-02    3C  Numbers2  2.306072
12 2019-02-03    1A  Numbers2 -0.504872
13 2019-02-03    2B  Numbers2  1.962642
14 2019-02-03    3C  Numbers2  1.028438
15 2019-02-04    1A  Numbers2  0.442359
16 2019-02-04    2B  Numbers2 -2.140087
17 2019-02-04    3C  Numbers2 -0.378992

In [9]:
df.melt(id_vars=['Date','Class'], value_vars=['Numbers'])

        Date Class variable     value
0 2019-02-02    1A  Numbers -1.749765
1 2019-02-02    2B  Numbers  0.342680
2 2019-02-02    3C  Numbers  1.153036
3 2019-02-03    1A  Numbers -0.252436
4 2019-02-03    2B  Numbers  0.981321
5 2019-02-03    3C  Numbers  0.514219
6 2019-02-04    1A  Numbers  0.221180
7 2019-02-04    2B  Numbers -1.070043
8 2019-02-04    3C  Numbers -0.189496

In [10]:
df.melt(id_vars=['Date','Class'], value_vars=['Numbers'], value_name="Numbers_Value", var_name="Num_Var")

        Date Class  Num_Var  Numbers_Value
0 2019-02-02    1A  Numbers      -1.749765
1 2019-02-02    2B  Numbers       0.342680
2 2019-02-02    3C  Numbers       1.153036
3 2019-02-03    1A  Numbers      -0.252436
4 2019-02-03    2B  Numbers       0.981321
5 2019-02-03    3C  Numbers       0.514219
6 2019-02-04    1A  Numbers       0.221180
7 2019-02-04    2B  Numbers      -1.070043
8 2019-02-04    3C  Numbers      -0.189496

# Stack and Unstack

In [11]:
df.set_index(["Date","Class"]).stack()

Date        Class
2019-02-02  1A     Numbers    -1.749765
                   Numbers2   -3.499531
            2B     Numbers     0.342680
                   Numbers2    0.685361
            3C     Numbers     1.153036
                   Numbers2    2.306072
2019-02-03  1A     Numbers    -0.252436
                   Numbers2   -0.504872
            2B     Numbers     0.981321
                   Numbers2    1.962642
            3C     Numbers     0.514219
                   Numbers2    1.028438
2019-02-04  1A     Numbers     0.221180
                   Numbers2    0.442359
            2B     Numbers    -1.070043
                   Numbers2   -2.140087
            3C     Numbers    -0.189496
                   Numbers2   -0.378992
dtype: float64

In [12]:
df.set_index(["Date","Class"]).stack().unstack()

                   Numbers  Numbers2
Date       Class
2019-02-02 1A    -1.749765 -3.499531
           2B     0.342680  0.685361
           3C     1.153036  2.306072
2019-02-03 1A    -0.252436 -0.504872
           2B     0.981321  1.962642
           3C     0.514219  1.028438
2019-02-04 1A     0.221180  0.442359
           2B    -1.070043 -2.140087
           3C    -0.189496 -0.378992

# Type -2: Reforming with aggregation

In [13]:
df=pd.DataFrame({"Date":pd.Index(pd.date_range(start='2/2/2019',periods=2)).repeat(4), "Class":["1A","2B","3C","1A","2B","3C","1A","2B"], "Numbers":np.random.randn(8)})

df

        Date Class   Numbers
0 2019-02-02    1A  0.255001
1 2019-02-02    2B -0.458027
2 2019-02-02    3C  0.435163
3 2019-02-02    1A -0.583595
4 2019-02-03    2B  0.816847
5 2019-02-03    3C  0.672721
6 2019-02-03    1A -0.104411
7 2019-02-03    2B -0.531280

# Group by

In [14]:
df.groupby('Date')["Numbers"].mean()

Date
2019-02-02   -0.087864
2019-02-03    0.213469
Name: Numbers, dtype: float64

In [15]:
df.groupby('Date', as_index=False)["Numbers"].mean()

        Date   Numbers
0 2019-02-02 -0.087864
1 2019-02-03  0.213469

In [16]:
df.groupby(['Date','Class'], as_index=False)["Numbers"].mean()

        Date Class   Numbers
0 2019-02-02    1A -0.164297
1 2019-02-02    2B -0.458027
2 2019-02-02    3C  0.435163
3 2019-02-03    1A -0.104411
4 2019-02-03    2B  0.142783
5 2019-02-03    3C  0.672721

In [20]:
df.groupby(['Date'], as_index=False).aggregate({"Numbers":"sum"})

        Date   Numbers
0 2019-02-02 -0.351457
1 2019-02-03  0.853876

# Pivot Table

In [21]:
df.pivot_table(index="Date", columns="Class")

             Numbers
Class             1A        2B        3C
Date
2019-02-02 -0.164297 -0.458027  0.435163
2019-02-03 -0.104411  0.142783  0.672721

In [22]:
df.pivot_table(index="Date", columns="Class", aggfunc="sum")

             Numbers
Class             1A        2B        3C
Date
2019-02-02 -0.328594 -0.458027  0.435163
2019-02-03 -0.104411  0.285567  0.672721

# Crosstab

In [23]:
pd.crosstab(df.Date, df.Class)

Class       1A  2B  3C
Date
2019-02-02   2   1   1
2019-02-03   1   2   1

In [24]:
pd.crosstab(df.Date, df.Class, values=df.Numbers, aggfunc='sum')

Class             1A        2B        3C
Date
2019-02-02 -0.328594 -0.458027  0.435163
2019-02-03 -0.104411  0.285567  0.672721

In [25]:
pd.crosstab(df.Date, df.Class, values=df.Numbers, aggfunc='mean')

Class             1A        2B        3C
Date
2019-02-02 -0.164297 -0.458027  0.435163
2019-02-03 -0.104411  0.142783  0.672721